app/Controllers/Home.php

SELECT `p`.`id`, `p`.`slug`, `p`.`name`, `b`.`name` AS `brand`, `p`.`avatar`, `p`.`price`, `p`.`discount_price`, `p`.`description`, `pc`.`name` AS `category`
FROM `bd_products` `p`
JOIN `bd_brands` `b` ON `b`.`id`=`p`.`brand_id`
JOIN `bd_product_categories` `pc` ON `pc`.`id`=`p`.`category_id`
WHERE `p`.`is_active` = 1
AND `p`.`deleted_by` = 0
AND `b`.`is_active` = 1
AND `b`.`deleted_by` = 0
AND `pc`.`is_active` = 1
AND `pc`.`deleted_by` = 0
AND `p`.`is_top_collection` = 1
SELECT *
FROM `bd_banners`
---
    public function index()
    {
        $model = db_connect();
        $products = $model->table("bd_products p");
        $products = $products->join("bd_brands b","b.id=p.brand_id");
        $products = $products->join("bd_product_categories pc","pc.id=p.category_id");
        $products = $products->select("p.id,p.slug,p.name,b.name AS brand,p.avatar,p.price,p.discount_price,p.description,pc.name AS category");
        $products = $products->where(["p.is_active" => 1,"p.deleted_by" => 0,"b.is_active" => 1,"b.deleted_by" => 0,"pc.is_active" => 1,"pc.deleted_by" => 0,"p.is_top_collection" => 1]);
        $data["products"] = $products->get()->getResultArray();

        $model = new Banner;
        $data["banners"] = $model->get()->getResultArray();

SELECT `p`.`id`, `p`.`slug`, `p`.`name`, `p`.`code`, `p`.`min_order`, `p`.`category_id`, `p`.`photos`, `p`.`in_stock`, `p`.`sku`, `p`.`product_condition`, `p`.`barcode`, `p`.`reference`, `b`.`name` AS `brand`, `p`.`avatar`, `p`.`price`, `p`.`discount_price`, `p`.`description`, `pc`.`name` AS `category`, `p`.`sub_category_id`, `p`.`video`
FROM `bd_products` `p`
JOIN `bd_brands` `b` ON `b`.`id`=`p`.`brand_id`
JOIN `bd_product_categories` `pc` ON `pc`.`id`=`p`.`category_id`
WHERE `p`.`slug` = 'galvanized-garden-tent-pegs-10pk'
AND `p`.`is_active` = 1
AND `p`.`deleted_by` = 0
AND `b`.`is_active` = 1
AND `b`.`deleted_by` = 0
AND `pc`.`is_active` = 1
AND `pc`.`deleted_by` = 0
SELECT `p`.`id`, `p`.`slug`, `p`.`name`, `p`.`code`, `p`.`min_order`, `p`.`category_id`, `p`.`in_stock`, `p`.`sku`, `p`.`product_condition`, `p`.`barcode`, `p`.`reference`, `b`.`name` AS `brand`, `p`.`avatar`, `p`.`price`, `p`.`discount_price`, `p`.`description`, `pc`.`name` AS `category`
FROM `bd_products` `p`
JOIN `bd_brands` `b` ON `b`.`id`=`p`.`brand_id`
JOIN `bd_product_categories` `pc` ON `pc`.`id`=`p`.`category_id`
WHERE `p`.`category_id` = '7'
AND `p`.`id` != '152'
AND `p`.`is_active` = 1
AND `p`.`deleted_by` = 0
AND `b`.`is_active` = 1
AND `b`.`deleted_by` = 0
AND `pc`.`is_active` = 1
AND `pc`.`deleted_by` = 0
 LIMIT 4
---
    public function search($slug)
    {
        $session = session();

        $model = db_connect();
        $product = $model->table("bd_products p");
        $product = $product->join("bd_brands b","b.id=p.brand_id");
        $product = $product->join("bd_product_categories pc","pc.id=p.category_id");
        $product = $product->select("p.id,p.slug,p.name,p.code,p.min_order,p.category_id,p.photos,p.in_stock,p.sku,p.product_condition,p.barcode,p.reference,b.name AS brand,p.avatar,p.price,p.discount_price,p.description,pc.name AS category,p.sub_category_id,p.video");
        $product = $product->where(["p.slug" => $slug,"p.is_active" => 1,"p.deleted_by" => 0,"b.is_active" => 1,"b.deleted_by" => 0,"pc.is_active" => 1,"pc.deleted_by" => 0]);
        $data["product"] = $product->get()->getRowArray();
        if($data["product"]) {
            $other_product = $model->table("bd_products p");
            $other_product = $other_product->join("bd_brands b","b.id=p.brand_id");
            $other_product = $other_product->join("bd_product_categories pc","pc.id=p.category_id");
            $other_product = $other_product->select("p.id,p.slug,p.name,p.code,p.min_order,p.category_id,p.in_stock,p.sku,p.product_condition,p.barcode,p.reference,b.name AS brand,p.avatar,p.price,p.discount_price,p.description,pc.name AS category");
            $other_product = $other_product->where(["p.category_id" => $data["product"]["category_id"],"p.id !=" => $data["product"]["id"],"p.is_active" => 1,"p.deleted_by" => 0,"b.is_active" => 1,"b.deleted_by" => 0,"pc.is_active" => 1,"pc.deleted_by" => 0]);
            $other_product = $other_product->limit(4);
            $data["other_products"] = $other_product->get()->getResultArray();